taskt/Core/Automation/Commands/UIAutomationGroup/AUIElementActionFromWindowSomethingByTreeWalkerCommands.dot
digraph "AUIElementActionFromWindowSomethingByTreeWalkerCommands" {
"AUIElementActionFromWindowSomethingByTreeWalkerCommands" -> "AUIElementActionFromSomethingByTreeWalkerCommands";
"AUIElementActionFromWindowSomethingByTreeWalkerCommands" -> "IWindowUIElementResultProperties";
"AUIElementActionFromSomethingByTreeWalkerCommands" -> "AUIElementActionSomewayCommands";
"AUIElementActionFromSomethingByTreeWalkerCommands" -> "IUIElementChildrenSearchParametersProperties";
"AUIElementActionFromSomethingByTreeWalkerCommands" -> "IUIElementDescendantsSearchAnyUIElementProperties";
"AUIElementActionSomewayCommands" -> "ScriptCommand";
"AUIElementActionSomewayCommands" -> "IUIElementUIElementActionSomewayProperties";
"AUIElementActionSomewayCommands" -> "IFromWindowNameResultsProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
