taskt/Core/Automation/Commands/UIAutomationGroup/AUIElementActionFromWindowSomethingByTreeWalkerCommands.puml
@startuml
AUIElementActionFromWindowSomethingByTreeWalkerCommands --> AUIElementActionFromSomethingByTreeWalkerCommands
AUIElementActionFromWindowSomethingByTreeWalkerCommands --> IWindowUIElementResultProperties
AUIElementActionFromSomethingByTreeWalkerCommands --> AUIElementActionSomewayCommands
AUIElementActionFromSomethingByTreeWalkerCommands --> IUIElementChildrenSearchParametersProperties
AUIElementActionFromSomethingByTreeWalkerCommands --> IUIElementDescendantsSearchAnyUIElementProperties
AUIElementActionSomewayCommands --> ScriptCommand
AUIElementActionSomewayCommands --> IUIElementUIElementActionSomewayProperties
AUIElementActionSomewayCommands --> IFromWindowNameResultsProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
